zibolux/Mowgli/stm32/ros_usbnode/src/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  Georg Swoboda <cn@warp.at>
  * @brief   main / bootup and initialization, motor control routines, usb init
  ******************************************************************************
  * Version 1.0 
  * 
  * compile with -DBOARD_YARDFORCE500 to enable the YF500 GForce pinout
  * 
  * ROS integration howto taken from here: https://github.com/Itamare4/ROS_stm32f1_rosserial_USB_VCP (Itamar Eliakim)
  * 
  ******************************************************************************
  */

#include <stdio.h>
#include <stdbool.h>
#include <stdarg.h>
#include <math.h>
#include <string.h>
#include "stm32f1xx_hal.h"
#include "stm32f1xx_hal_uart.h"
#include "stm32f1xx_hal_adc.h"
#include "main.h"
// stm32 custom
#include "board.h"
#include "panel.h"
#include "emergency.h"
#include "blademotor.h"
#include "drivemotor.h"
#include "ultrasonic_sensor.h"
#include "soft_i2c.h"
#include "spiflash.h"
#include "i2c.h"
#include "imu/imu.h"
#include "usb_device.h"
#include "usbd_cdc_if.h"
#include "nbt.h"

// ros
#include "cpp_main.h"
#include "ringbuffer.h"

static nbt_t main_chargecontroller_nbt;
static nbt_t main_statusled_nbt;
static nbt_t main_emergency_nbt;
static nbt_t main_ultrasonicsensor_nbt;
static nbt_t main_blademotor_nbt;



// MASTER rx buffering
static uint8_t master_rcvd_data;
volatile uint8_t  master_rx_buf[32];
volatile uint32_t master_rx_buf_idx = 0;
volatile uint8_t  master_rx_buf_crc = 0;
volatile uint8_t  master_rx_LENGTH = 0;
volatile uint8_t  master_rx_CRC = 0;
volatile uint8_t  master_rx_STATUS = RX_WAIT;
// MASTER tx buffering
volatile uint8_t  master_tx_busy = 0;
static uint8_t master_tx_buffer_len;
static char master_tx_buffer[255];

#define ADC_NUMBER_MEASURE 80
typedef struct 
{
    uint16_t current_raw;
    uint16_t charge_voltage_raw;
    uint16_t battery_voltage_raw;
    uint16_t chargerInput_voltage_raw;
}__attribute__((__packed__))ADC_Data_t;

volatile ADC_Data_t adc_buffer[ADC_NUMBER_MEASURE]={0};

typedef enum{
    CHARGER_STATE_IDLE,
    CHARGER_STATE_CONNECTED,
    CHARGER_STATE_CHARGING_CC,
    CHARGER_STATE_CHARGING_CV,
    CHARGER_STATE_END_CHARGING,
} CHARGER_STATE_e;

int blade_motor = 0;

static uint8_t panel_rcvd_data;
volatile float batteryVoltage,current,chargerVoltage,chargerInputVoltage;
// exported via rostopics
float_t battery_voltage;
float_t charge_voltage;
float_t charge_current;
float_t charge_current_offset = -0.086f;
uint16_t chargecontrol_pwm_val = MIN_CHARGE_PWM;
uint8_t  chargecontrol_is_charging = 0;

UART_HandleTypeDef MASTER_USART_Handler; // UART  Handle

// SPI3 FLASH
SPI_HandleTypeDef SPI3_Handle;

// Drive Motors DMA

DMA_HandleTypeDef hdma_uart4_rx;
DMA_HandleTypeDef hdma_uart4_tx;
DMA_HandleTypeDef hdma_adc;

ADC_HandleTypeDef ADC_Handle;
TIM_HandleTypeDef TIM1_Handle;  // PWM Charge Controller
TIM_HandleTypeDef TIM2_Handle;  // Time Base for ADC
TIM_HandleTypeDef TIM3_Handle;  // PWM Beeper

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * called when DMA transfer completes
 * update <xxxx>_tx_busy to let XXXX_Transmit function now when the DMA buffer is free 
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{   
    if (huart->Instance == MASTER_USART_INSTANCE)
    {
        if (__HAL_USART_GET_FLAG(&MASTER_USART_Handler, USART_FLAG_TC))        
        {
            master_tx_busy = 0;
        }
    }
}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart)
{
   // do nothing here
}

/*
 * Master UART receive ISR
 * DriveMotors UART receive ISR
 * PANEL UART receive ISR
 */ 
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{           
       if (huart->Instance == MASTER_USART_INSTANCE)
       {
            ULTRASONICSENSOR_ReceiceIT();       
       }
       else if(huart->Instance == BLADEMOTOR_USART_INSTANCE)
       {
            BLADEMOTOR_ReceiceIT();
       }
       else if (huart->Instance == DRIVEMOTORS_USART_INSTANCE)
       {
        DRIVEMOTOR_ReceiceIT();
       }       
       else if(huart->Instance == PANEL_USART_INSTANCE)
       {
           PANEL_Handle_Received_Data(panel_rcvd_data);
           HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
       }
}

int main(void)
{        
   HAL_Init();
    SystemClock_Config();

    __HAL_RCC_AFIO_CLK_ENABLE();    
    __HAL_RCC_PWR_CLK_ENABLE();

    MX_DMA_Init();
    
    MASTER_USART_Init();

    DB_TRACE("\r\n");
    DB_TRACE("    __  ___                    ___\r\n");
    DB_TRACE("   /  |/  /___ _      ______ _/ (_)\r\n");
    DB_TRACE("  / /|_/ / __ \\ | /| / / __ `/ / / \r\n");
    DB_TRACE(" / /  / / /_/ / |/ |/ / /_/ / / /  \r\n");
    DB_TRACE("/_/  /_/\\____/|__/|__/\\__, /_/_/   \r\n");
    DB_TRACE("                     /____/        \r\n");
    DB_TRACE("\r\n\r\n");
    DB_TRACE(" * Master USART (debug) initialized\r\n");
    LED_Init();
    DB_TRACE(" * LED initialized\r\n");
    TIM2_Init();
    ADC1_Init();    
    DB_TRACE(" * ADC1 initialized\r\n");  
    TIM3_Init();
    HAL_TIM_PWM_Start(&TIM3_Handle, TIM_CHANNEL_4);    
    DB_TRACE(" * Timer3 (Beeper) initialized\r\n"); 
    TF4_Init();
    DB_TRACE(" * 24V switched on\r\n");
    RAIN_Sensor_Init();
    DB_TRACE(" * RAIN Sensor enable\r\n");
    
    if (SPIFLASH_TestDevice())
    {        
        SPIFLASH_Config();
        SPIFLASH_IncBootCounter();
    }
    else
    {
         DB_TRACE(" * SPIFLASH: unable to locate SPI Flash\r\n");    
    }    
    DB_TRACE(" * SPIFLASH initialized\r\n");

    I2C_Init();
    DB_TRACE(" * Hard I2C initialized\r\n");
    if (I2C_Acclerometer_TestDevice())
    {
         I2C_Accelerometer_Setup();          
    }
    else
    {
        chirp(3);        
        DB_TRACE(" * WARNING: initalization of onboard accelerometer for tilt protection failed !\r\n");
    }    
    DB_TRACE(" * Accelerometer (onboard/tilt safety) initialized\r\n");    
    //SW_I2C_Init();
    DB_TRACE(" * Soft I2C (J18) initialized\r\n");
    DB_TRACE(" * Testing supported IMUs:\r\n");
    //IMU_TestDevice();
    //IMU_Init();
    //IMU_Calibrate();
    Emergency_Init();
    DB_TRACE(" * Emergency sensors initialized\r\n");  
    TIM1_Init();   
    DB_TRACE(" * Timer1 (Charge PWM) initialized\r\n");    
    MX_USB_DEVICE_Init();
    DB_TRACE(" * USB CDC initialized\r\n");
    PANEL_Init();
    DB_TRACE(" * Panel initialized\r\n");
    
    // Charge CH1/CH1N PWM Timer
    HAL_TIM_PWM_Start(&TIM1_Handle, TIM_CHANNEL_1);
    HAL_TIMEx_PWMN_Start(&TIM1_Handle, TIM_CHANNEL_1);
    DB_TRACE(" * Charge Controler PWM Timers initialized\r\n");
    
    // Init Drive Motors and Blade Motor
    #ifdef DRIVEMOTORS_USART_ENABLED
        DRIVEMOTOR_Init();
        DB_TRACE(" * Drive Motors USART initialized\r\n");        
    #endif
    #ifdef BLADEMOTOR_USART_ENABLED
        BLADEMOTOR_Init();
    #endif
    

   // HAL_UART_Receive_IT(&MASTER_USART_Handler, &master_rcvd_data, 1);
    DB_TRACE(" * Master Interrupt enabled\r\n");
    
    HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
    DB_TRACE(" * Panel Interrupt enabled\r\n");

    HAL_GPIO_WritePin(LED_GPIO_PORT, LED_PIN, 0);
    HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 1);  
  

    // Initialize Main Timers
	NBT_init(&main_chargecontroller_nbt, 10);
    NBT_init(&main_statusled_nbt, 1000);
	NBT_init(&main_emergency_nbt, 10);
    NBT_init(&main_ultrasonicsensor_nbt, 50);
    NBT_init(&main_blademotor_nbt, 100);

    DB_TRACE(" * NBT Main timers initialized\r\n");     

 #ifdef I_DONT_NEED_MY_FINGERS
    DB_TRACE("\r\n");
    DB_TRACE("=========================================================\r\n");
    DB_TRACE(" EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
    DB_TRACE("=========================================================\r\n");
    DB_TRACE("\r\n");
 #endif
    // Initialize ROS
    init_ROS();
    DB_TRACE(" * ROS serial node initialized\r\n");     
    DB_TRACE("\r\n >>> entering main loop ...\r\n\r\n"); 
    // <chirp><chirp> means we are in the main loop 
    chirp(2);    
    while (1)
    {        
        chatter_handler();
        motors_handler();    
        panel_handler();
        spinOnce();                       
        broadcast_handler(); 

        DRIVEMOTOR_App_Rx();

      if (NBT_handler(&main_chargecontroller_nbt))
	    {            
			ChargeController();
	    }
        if (NBT_handler(&main_statusled_nbt))
	    {            
			StatusLEDUpdate();          
                       
