zibolux/Mowgli/stm32/ros_usbnode/src/main.c
/*
 * print hex bytes
 */
void msgPrint(uint8_t *msg, uint8_t msg_len)
{
     int i;
     DB_TRACE("msg: ");
     for (i=0;i<msg_len;i++)
     {
        DB_TRACE(" %02x", msg[i]);
     }            
     DB_TRACE("\r\n");
}

/*
 * calc crc byte
 */
uint8_t crcCalc(uint8_t *msg, uint8_t msg_len)
{
    uint8_t crc = 0x0;
    uint8_t i;

    for (i=0;i<msg_len;i++)
    {
        crc += msg[i];
    }
    return(crc);
}

/*
 * 2khz chirps
 */
void chirp(uint8_t count)
{    
    uint8_t i;

    for (i=0;i<count;i++)
    {
        TIM3_Handle.Instance->CCR4 = 10;   
        HAL_Delay(100);
        TIM3_Handle.Instance->CCR4 = 0;  
        HAL_Delay(50);
    }
}

/*
 * Debug print via MASTER USART
 */
void vprint(const char *fmt, va_list argp)
{
    char string[200];    
    if(0 < vsprintf(string,fmt,argp)) // build string
    {
         for (int i = 0; i < strlen(string); i++)
         {
             ITM_SendChar(string[i]);
         }
       // MASTER_Transmit((unsigned char*)string, strlen(string));

        // HAL_UART_Transmit(&MASTER_USART_Handler, (uint8_t*)string, strlen(string), HAL_MAX_DELAY); // send message via UART               
        //while (master_tx_busy) {  }
        //master_tx_busy = 1;        
        //master_tx_buffer_len = strlen(string);
        //memcpy(master_tx_buffer, string, master_tx_buffer_len);
        //HAL_UART_Transmit_DMA(&MASTER_USART_Handler, (uint8_t*)master_tx_buffer, master_tx_buffer_len); // send message via UART                
        // HAL_Delay(10);
    }
}

/*
 * Debug print
 */
void debug_printf(const char *fmt, ...) 
{
    va_list argp;
    va_start(argp, fmt);
    vprint(fmt, argp);
    va_end(argp);
}

/*
 * Send message via MASTER USART (DMA Normal Mode)
 */
void MASTER_Transmit(uint8_t *buffer, uint8_t len)
{    
    // wait until tx buffers are free (send complete)
    while (master_tx_busy) {  }
    master_tx_busy = 1;  
    // copy into our master_tx_buffer 
    master_tx_buffer_len = len;
    memcpy(master_tx_buffer, buffer, master_tx_buffer_len);
    HAL_UART_Transmit_DMA(&MASTER_USART_Handler, (uint8_t*)master_tx_buffer, master_tx_buffer_len); // send message via UART       
}


void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
  volatile int i = 0;
  volatile uint32_t l_u32Current_sum = 0;
  volatile uint32_t l_u32BatVoltage_sum = 0;
  volatile uint32_t l_u32ChargerVoltage_sum = 0;
  volatile uint32_t l_u32ChargerInputVoltage_sum = 0;
  
  
  for(i= 40;i<80;++i){
        l_u32Current_sum += adc_buffer[i].current_raw;
        l_u32ChargerVoltage_sum += adc_buffer[i].charge_voltage_raw;
        l_u32BatVoltage_sum += adc_buffer[i].battery_voltage_raw;
        l_u32ChargerInputVoltage_sum += adc_buffer[i].chargerInput_voltage_raw;
    }
   
  current = (float)l_u32Current_sum/(40);
  chargerVoltage = (float)l_u32ChargerVoltage_sum/(40);
  batteryVoltage = (float)l_u32BatVoltage_sum/(40);
  chargerInputVoltage = (float)l_u32ChargerInputVoltage_sum/(40);

  current = ((float)(current/4095.0f)*3.3f - 2.5f) * 100/12.0;
  chargerVoltage = (float)(chargerVoltage/4095.0f)*3.3f*16;
  batteryVoltage = (float)(batteryVoltage/4095.0f)*3.3f*10 + 0.3f;
  chargerInputVoltage = (chargerInputVoltage/4095.0f)*3.3f * (32/2) + 0.6f;


}
void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc){
    volatile int i = 0;
    volatile uint32_t l_u32Current_sum = 0;
    volatile uint32_t l_u32BatVoltage_sum = 0;
    volatile uint32_t l_u32ChargerVoltage_sum = 0;
    volatile uint32_t l_u32ChargerInputVoltage_sum = 0;

    for(i= 0;i<40;++i){
        l_u32Current_sum += adc_buffer[i].current_raw;
        l_u32ChargerVoltage_sum += adc_buffer[i].charge_voltage_raw;
        l_u32BatVoltage_sum += adc_buffer[i].battery_voltage_raw;
        l_u32ChargerInputVoltage_sum += adc_buffer[i].chargerInput_voltage_raw;
    }
    
    current = (float)l_u32Current_sum/(40);
    chargerVoltage = (float)l_u32ChargerVoltage_sum/(40);
    batteryVoltage = (float)l_u32BatVoltage_sum/(40);

    current = ((float)(current/4095.0f)*3.3f - 2.5f) * 100/12.0;
    chargerVoltage = (float)(chargerVoltage/4095.0f)*3.3f*16;
    batteryVoltage = (float)(batteryVoltage/4095.0f)*3.3f*10 + 0.3f;
    chargerInputVoltage = (chargerInputVoltage/4095.0f)*3.3f * (32/2) + 0.6f;
}